{
    "first_name": "Hung Hao",
    "last_name": "Hsu",
    "profile_text": "I always have passion about new technologies. Whether it’s Cloud Computing, Artificial Intelligence, or Internet Security. I enjoy learning and exploring things that make our life more efficient. I also enjoy talking to people from different backgrounds to absorb knowledge from various fields. In the field of cloud, I have several years of hands-on experience on AWS, and start working as a Cloud Engineer since 2018.",
    "experience": [
        {
            "job_title": "Cloud Development Engineer",
            "company": "Arcadyan Technology Corporation",
            "date": "August 2020 - Present",
            "tasks": [
                "Designed and developed cloud native application to collect, analyze, manage and optimize network equipments using NodeJs and Hadoop big data framework.",
                "Increased site reliability by designing load balanced, distributed system with proper disaster recovery plans.",
                "Communicate with customers abroad to clarify requirements and help improve customer experience.",
                "Architected several cloud applications, managed and organized resources for the development."

            ]
        },
        {
            "job_title": "Cloud Development Engineer",
            "company": "eCloudvalley Digital Technology",
            "date": "December 2018 - March 2020",
            "tasks": [
                "Built an application that scans for potential security risks, suggestion of high availability on AWS and generated a report that highlight the issues with python.",
                "Designed loose coupled applications,  built microservices and serverless architecture on AWS that saved around 60% of the operation cost.",
                "Collaborated with product team to develop code, design system and test solutions for our Cloud Management Platform."
            ]
        },
        {
            "job_title": "Cloud Support Engineer",
            "company": "eCloudvalley Digital Technology",
            "date": "July 2018 - December 2018",
            "tasks": [
                "Analyzed needs of customers and provide possible solutions, supported customers with technical issues such as scaling their databases automatically and load balancing traffic for their websites.",
                "Established operating procedure and technical document, which drops the training time of new colleges significantly."
            ]
        },
        {
            "job_title": "Project Owner",
            "company": "Racetrack Cloud Services",
            "date": "February 2019 - May 2019",
            "tasks": [
                "Identified client’s needs and effectively communicated project scope, schedule, and budget, then planned, organize, and implement all aspects of the construction project.",
                "Built a prototype child toy that can analyze children’s behavior while they are playing, and identify possible learning disability at an early age, such as Visual Spatial Perceptual Disorder, Developmental Dyslexia or Specific Learning Disabilities in Mathematics.",
                "Documented deployment and post deployment procedures."
            ]
        }
    ],
    "certifications":[
        "AWS Certified Solutions Architect – Associate",
        "AWS Certified Developer – Associate",
        "AWS Certified Sysops Administrator – Associate",
        "AWS Certified Cloud Practitioner",
        "Gold Certificate of TOEIC"
    ],
    "specialty":[
        "Microservices",
        "Distributed System",
        "Cloud Computing",
        "Container",
        "Agile Development"

    ],
    "education": [
        {
            "school": "National Chiao Tung University, Taiwan",
            "program": "Bachelor of Computer Science",
            "date": "September 2016 - June 2020"
        },
        {
            "school": "New York University, New York",
            "program": "Comprehensive English Program",
            "date": "May 2016 - August 2016"
        }
    ],
    "interest_text": "To be written"
    
}